"GENERAL PREFERENCES" = "Tùy chọn Tổng quát";
"TURN ON 3G WHEN NO INTERNET ACCESS AVAILABLE" = "Bật 3G khi không có điểm truy cập Internet khả dụng";
"HIDE ICON" = "Dấu Biểu tượng";
"SAVE TO LIBRARY" = "Lưu vào Thư viện";
"AUTO TURN ON WIFI" = "Tự động Bật WIFI";
"AUTO TURN ON 3G" = "Tự động Bật 3G";
"GENERAL SETTINGS" = "Cài đặt Tổng quát";